### Forest mainnet Infrastructure Plan: success

<details><summary>Show Plan</summary>

```
module.mainnet.data.digitalocean_project.forest_project: Reading...
module.mainnet.digitalocean_volume.forest_volume[0]: Refreshing state... [id=e90504c3-ef32-11ed-9d6a-0a58ac14d023]
module.mainnet.data.digitalocean_ssh_keys.keys: Reading...
module.mainnet.data.digitalocean_ssh_keys.keys: Read complete after 0s [id=ssh_keys/12886492327922169494]
module.mainnet.digitalocean_droplet.forest_observability: Refreshing state... [id=354655869]
module.mainnet.digitalocean_droplet.forest: Refreshing state... [id=354655868]
module.mainnet.local_file.inventory: Refreshing state... [id=31d23f35d2a3e5dec91daeebfc3bb120bf41a90f]
module.mainnet.digitalocean_firewall.forest_observability_firewall: Refreshing state... [id=87952d07-de7f-4ad9-93bc-a425bc8a187a]
module.mainnet.digitalocean_firewall.forest_firewall: Refreshing state... [id=4bf35d04-896c-4738-9c28-67b3c85557f1]
module.mainnet.digitalocean_volume_attachment.forest_volume[0]: Refreshing state... [id=354655868-e90504c3-ef32-11ed-9d6a-0a58ac14d023-20230510130242286700000001]
module.mainnet.data.digitalocean_project.forest_project: Read complete after 1s [id=da5e6601-7fd9-4d02-951e-390f7feb3411]
module.mainnet.digitalocean_project_resources.connect_forest_project: Refreshing state... [id=da5e6601-7fd9-4d02-951e-390f7feb3411]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.mainnet.local_file.inventory will be created
  + resource "local_file" "inventory" {
      + content              = <<-EOT
            [forest]
            46.101.114.214
            [observability]
            209.38.252.211
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../ansible/hosts_mainnet"
      + id                   = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>